In [6]:
#1. There are three different tables as given above. Please make three dataframe in python and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only.
import pandas as pd

Projects_Dataframe = pd.DataFrame({
    'ID' : ['A001','A002','A003','A004','A005','A002','A005','A003', 'A001','A003', 'A001', 'A004', 'A004', 'A005'],
    'Project' : ['Project 1','Project 2','Project 3','Project 4','Project 5','Project 6','Project 7','Project 8','Project 9','Project 10','Project 11','Project 12','Project 13','Project 14'],
    'Cost' : [1002000,2000000,4500000,5500000,None,680000,400000,350000,None,300000,2000000,1000000,3000000,200000],
    'Status' : ['Finished','Ongoing','Finished','Ongoing','Finished','Failed','Finished','Failed','Ongoing','Finished','Failed','Ongoing','Finished','Finished']
})

dataframes = {
    'df_projects': Projects_Dataframe,
}

df = pd.DataFrame(Projects_Dataframe)

df.to_csv('Projects_Dataframe.csv', index=False)
print('Dataframe saved to Projects_Dataframe.csv')

Dataframe saved to Projects_Dataframe.csv

In [7]:
#1. There are three different tables as given above. Please make three dataframe in python and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only.
import pandas as pd

Employee_Dataframe = pd.DataFrame({
    'ID' : ['A001','A002','A003','A004','A005'],
    'Name' : ['John Alter','Alice Luxumberg','Tom Sabestine','Nina Adgra','Amy Johny'],
    'Gender' : ['M','F','M','F','F'],
    'City' : ['Paris','London','Berlin','Newyork','Madrid'],
    'Age' : [25,27,29,31,30]
})

dataframes = {
    'df_other': Employee_Dataframe,
}
df = pd.DataFrame(Employee_Dataframe)

df.to_csv('Employee_Dataframe.csv', index=False)
print("Dataframe saved to 'Employee_Dataframe.csv'")

Dataframe saved to 'Employee_Dataframe.csv'

In [8]:
#1. There are three different tables as given above. Please make three dataframe in python and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only.
import pandas as pd

Seniority_Level_Dataframe = pd.DataFrame({
    'ID' : ['A001','A002','A003','A004','A005'],
    'Designation Level' : [2,2,3,2,3]
})

dataframes = {
    'df_another': Seniority_Level_Dataframe,
}
df = pd.DataFrame(Seniority_Level_Dataframe)

df.to_csv('Seniority_Level_Dataframe.csv', index=False)
print("Dataframe saved to 'Seniority_Level_Dataframe.csv'")

Dataframe saved to 'Seniority_Level_Dataframe.csv'

In [9]:
#2. The cost column in the dataframe “Project” has some missing values. Your task is to compute these missing values. Replace the missing values by running average. You should use the “For” loop for this task.

import pandas as pd
import numpy as np

dataframes = {
    'df_projects': Projects_Dataframe,
}

target_df_name = 'df_projects'

# Check if the target DataFrame exists
if target_df_name in dataframes and isinstance(dataframes[target_df_name], pd.DataFrame):
    df = dataframes[target_df_name]

    # Replace missing values in the "Cost" column using a running average
    for i in range(len(df)):
        if np.isnan(df.loc[i, 'Cost']):
            running_sum = 0
            count = 0
            for j in range(i):
                if not np.isnan(df.loc[j, 'Cost']):
                    running_sum += df.loc[j, 'Cost']
                    count += 1
            if count > 0:
                df.loc[i, 'Cost'] = running_sum / count

    # The original DataFrame in the dictionary is now updated in place
    dataframes[target_df_name] = df
    print(f"Missing values in 'Cost' column of '{target_df_name}' replaced with running average and saved in the same DataFrame.")

else:
    print(f"DataFrame '{target_df_name}' not found.")

Missing values in 'Cost' column of 'df_projects' replaced with running average and saved in the same DataFrame.

In [10]:
#3. Split the name column in the Employee dataframe into two new columns “First Name”, and “LastName” and remove the older “name” column.

import numpy as np
import pandas as pd

dataframes = {
    'df_other': Employee_Dataframe,
}

Employee_Dataframe = dataframes['df_other']

# Split 'Name' into 'First Name' and 'Last Name'
split_names = Employee_Dataframe['Name'].str.split(' ')

Employee_Dataframe[['First Name', 'Last Name']] = pd.DataFrame(split_names.tolist(), index=Employee_Dataframe.index)

# Drop the original 'Name' column
Employee_Dataframe = Employee_Dataframe.drop(columns=['Name'])

print(Employee_Dataframe)

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [11]:
#4. Join all three dataframes in one single dataframe. Name it “Final”
import pandas as pd

dataframes = {
    'df_projects': Projects_Dataframe,
    'df_other': Employee_Dataframe,
    'df_another': Seniority_Level_Dataframe,
}

Employee_Dataframe = dataframes['df_other']
Seniority_Level_Dataframe = dataframes['df_another']
Projects_Dataframe = dataframes['df_projects']

merged_df = pd.merge(Employee_Dataframe, Seniority_Level_Dataframe, on='ID', how='left')


Final = pd.merge(merged_df, Projects_Dataframe, on='ID', how='left')

print(Final)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  2
3   A002      F   London   27      Alice  Luxumberg                  2
4   A002      F   London   27      Alice  Luxumberg                  2
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  3
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project       Cost    Status
0    Project 1  1002000.0  Finished
1    Project 9  2210312.5   Ongoing
2   Project 11  2000000.0    Failed
3    Project 2  2000000.0   Ongoing
4    Project 6   680000.0    Failed
5    Project 3  4500000.0  Finished
6    Project 8   350000.0    Failed
7   Project 10   300000.0  Finished
8    Project 4  5500000.0   Ongoing
9   Project 12  1000000.0   Ongoing
10  Project 13  3000000.0  Finished
11   Project 5  3250500.0  Finished
12   Project 7   400000.0  Finished
13  Project 14   200000.0  Finished

In [12]:
#5. Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project cost only to employees who have finished the projects.

import pandas as pd

# Calculate the bonus: 5% of the project cost for "Finished" projects, otherwise 0
Final['Bonus'] = Final.apply(
    lambda row: row['Cost'] * 0.05 if row['Status'] == 'Finished' and pd.notnull(row['Cost']) else 0,
    axis=1
)

# Display the final dataframe with the new Bonus column
print(Final)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  2
3   A002      F   London   27      Alice  Luxumberg                  2
4   A002      F   London   27      Alice  Luxumberg                  2
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  3
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project       Cost    Status     Bonus
0    Project 1  1002000.0  Finished   50100.0
1    Project 9  2210312.5   Ongoing       0.0
2   Project 11  2000000.0    Failed       0.0
3    Project 2  2000000.0   Ongoing       0.0
4    Project 6   680000.0    Failed       0.0
5    Project 3  4500000.0  Finished  225000.0
6    Project 8   350000.0    Failed       0.0
7   Project 10   300000.0  Finished   15000.0
8    Project 4  5500000.0   Ongoing       0.0
9   Project 12  1000000.0   Ongoing       0.0
10  Project 13  3000000.0  Finished  150000.0
11   Project 5  3250500.0  Finished  162525.0
12   Project 7   400000.0  Finished   20000.0
13  Project 14   200000.0  Finished   10000.0

In [13]:
#6. Demote the designation level by 1, whose projects have status “fail”. Delete the employees record whose designation level is above 4.

import pandas as pd

#Demote the designation level by 1 for projects with status "Failed"
Final.loc[Final['Status'] == 'Failed', 'Designation Level'] -= 1

# Step 2: Remove employees whose designation level is above 4
Final = Final[Final['Designation Level'] <= 4]

# Display the updated dataframe
print(Final)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  1
3   A002      F   London   27      Alice  Luxumberg                  2
4   A002      F   London   27      Alice  Luxumberg                  1
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  2
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project       Cost    Status     Bonus
0    Project 1  1002000.0  Finished   50100.0
1    Project 9  2210312.5   Ongoing       0.0
2   Project 11  2000000.0    Failed       0.0
3    Project 2  2000000.0   Ongoing       0.0
4    Project 6   680000.0    Failed       0.0
5    Project 3  4500000.0  Finished  225000.0
6    Project 8   350000.0    Failed       0.0
7   Project 10   300000.0  Finished   15000.0
8    Project 4  5500000.0   Ongoing       0.0
9   Project 12  1000000.0   Ongoing       0.0
10  Project 13  3000000.0  Finished  150000.0
11   Project 5  3250500.0  Finished  162525.0
12   Project 7   400000.0  Finished   20000.0
13  Project 14   200000.0  Finished   10000.0

In [18]:
#7. Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

import pandas as pd


#Add "Mr." for males and "Mrs." for females to the first name
Final['First Name'] = Final.apply(
    lambda row: f"Mr. {row['First Name']}" if row['Gender'] == 'M' else f"Mrs. {row['First Name']}",
    axis=1
)

# Step 2: Drop the gender column
Final = Final.drop(columns=['Gender'])

print(Final)

      ID     City  Age  First Name  Last Name  Designation Level     Project  \
0   A001    Paris   25    Mr. John      Alter                  2   Project 1
1   A001    Paris   25    Mr. John      Alter                  2   Project 9
2   A001    Paris   25    Mr. John      Alter                  1  Project 11
3   A002   London   27  Mrs. Alice  Luxumberg                  2   Project 2
4   A002   London   27  Mrs. Alice  Luxumberg                  1   Project 6
5   A003   Berlin   29     Mr. Tom  Sabestine                  3   Project 3
6   A003   Berlin   29     Mr. Tom  Sabestine                  2   Project 8
7   A003   Berlin   29     Mr. Tom  Sabestine                  3  Project 10
8   A004  Newyork   31   Mrs. Nina      Adgra                  2   Project 4
9   A004  Newyork   31   Mrs. Nina      Adgra                  2  Project 12
10  A004  Newyork   31   Mrs. Nina      Adgra                  2  Project 13
11  A005   Madrid   30    Mrs. Amy      Johny                  3   Project 5
12  A005   Madrid   30    Mrs. Amy      Johny                  3   Project 7
13  A005   Madrid   30    Mrs. Amy      Johny                  3  Project 14

         Cost    Status     Bonus
0   1002000.0  Finished   50100.0
1   2210312.5   Ongoing       0.0
2   2000000.0    Failed       0.0
3   2000000.0   Ongoing       0.0
4    680000.0    Failed       0.0
5   4500000.0  Finished  225000.0
6    350000.0    Failed       0.0
7    300000.0  Finished   15000.0
8   5500000.0   Ongoing       0.0
9   1000000.0   Ongoing       0.0
10  3000000.0  Finished  150000.0
11  3250500.0  Finished  162525.0
12   400000.0  Finished   20000.0
13   200000.0  Finished   10000.0

In [19]:
#8. Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

import pandas as pd

#Promote the designation level by 1 for employees whose age is more than 29 years
Final.loc[Final['Age'] > 29, 'Designation Level'] +=1

print(Final)

      ID     City  Age  First Name  Last Name  Designation Level     Project  \
0   A001    Paris   25    Mr. John      Alter                  2   Project 1
1   A001    Paris   25    Mr. John      Alter                  2   Project 9
2   A001    Paris   25    Mr. John      Alter                  1  Project 11
3   A002   London   27  Mrs. Alice  Luxumberg                  2   Project 2
4   A002   London   27  Mrs. Alice  Luxumberg                  1   Project 6
5   A003   Berlin   29     Mr. Tom  Sabestine                  3   Project 3
6   A003   Berlin   29     Mr. Tom  Sabestine                  2   Project 8
7   A003   Berlin   29     Mr. Tom  Sabestine                  3  Project 10
8   A004  Newyork   31   Mrs. Nina      Adgra                  3   Project 4
9   A004  Newyork   31   Mrs. Nina      Adgra                  3  Project 12
10  A004  Newyork   31   Mrs. Nina      Adgra                  3  Project 13
11  A005   Madrid   30    Mrs. Amy      Johny                  4   Project 5
12  A005   Madrid   30    Mrs. Amy      Johny                  4   Project 7
13  A005   Madrid   30    Mrs. Amy      Johny                  4  Project 14

         Cost    Status     Bonus
0   1002000.0  Finished   50100.0
1   2210312.5   Ongoing       0.0
2   2000000.0    Failed       0.0
3   2000000.0   Ongoing       0.0
4    680000.0    Failed       0.0
5   4500000.0  Finished  225000.0
6    350000.0    Failed       0.0
7    300000.0  Finished   15000.0
8   5500000.0   Ongoing       0.0
9   1000000.0   Ongoing       0.0
10  3000000.0  Finished  150000.0
11  3250500.0  Finished  162525.0
12   400000.0  Finished   20000.0
13   200000.0  Finished   10000.0

In [20]:
# 9. Add the cost of all projects for each Employee and save it in new dataframe “TotalProjCost” with three columns ID, First Name, and Total cost

import pandas as pd


# Step 1: Group by 'ID' and 'First Name', then sum the 'Cost' for each employee
total_cost = Final.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()

# Step 2: Rename the 'Cost' column to 'Total Cost'
total_cost.rename(columns={'Cost': 'Total Cost'}, inplace=True)

# Step 3: Create the TotalProjCost dataframe
TotalProjCost = total_cost[['ID', 'First Name', 'Total Cost']]

# Display the TotalProjCost dataframe
print(TotalProjCost)

     ID  First Name  Total Cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

In [21]:
#10. Print all the employee details whose city name contains the letter “o” in it.

import pandas as pd


# Filter the rows where the 'City' column contains the letter "o"
employees_in_cities_with_o = Final[Final['City'].str.contains('o', case=False, na=False)]


print(employees_in_cities_with_o)

      ID     City  Age  First Name  Last Name  Designation Level     Project  \
3   A002   London   27  Mrs. Alice  Luxumberg                  2   Project 2
4   A002   London   27  Mrs. Alice  Luxumberg                  1   Project 6
8   A004  Newyork   31   Mrs. Nina      Adgra                  3   Project 4
9   A004  Newyork   31   Mrs. Nina      Adgra                  3  Project 12
10  A004  Newyork   31   Mrs. Nina      Adgra                  3  Project 13

         Cost    Status     Bonus
3   2000000.0   Ongoing       0.0
4    680000.0    Failed       0.0
8   5500000.0   Ongoing       0.0
9   1000000.0   Ongoing       0.0
10  3000000.0  Finished  150000.0